In [1]:
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline

In [2]:
'''
Create fun. range_series.. initialize it 1 and end to 10 print range_series
(1,5) ii) range_series(5)  iii)range_series(5,10)

'''
def range_series(start=1,end=10):
    return pd.Series(list(range(start,end+1)))

In [3]:
range_series(1,5)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [4]:
range_series()

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [8]:
range_series(5,10)

0     5
1     6
2     7
3     8
4     9
5    10
dtype: int64

In [9]:
range_series(5)

0     5
1     6
2     7
3     8
4     9
5    10
dtype: int64

In [15]:
'''
create dataframes (['one','two'],[['x','y'],['A','B']])
'''
def create_dataframes(keys,values):
    data_dict={keys[index]:values[index] for index in range(0,len(keys))}
    return pd.DataFrame(data_dict)

In [16]:
create_dataframes(['one','two'],[['x','y'],['A','B']])

  one two
0   x   A
1   y   B

In [18]:
'''
Create dataframe wich concatenate two df's and reset index
'''
def concat_df(df1,df2):
    return pd.concat([df1,df2]).reset_index(drop=True)
concat_df(create_dataframes(['one','two'],[['w','x'],['A','B']]),
         create_dataframes(['one','two'],[['y','z'],['C','D']]))

  one two
0   w   A
1   x   B
2   y   C
3   z   D

In [22]:
'''
Load data cars.csv and print 'count','mean','std','min','25%','50%','75%','max'
'''
df=pd.read_csv('mtcars2.csv')
df.describe()

,S.No,mpg,cyl,disp,hp,drat,wt,qsec,vs,am,gear,carb
count,32.000000,32.000000,32.000000,32.000000,32.000000,32.000000,32.000000,29.000000,32.000000,32.000000,32.000000,32.0000
mean,16.500000,20.090625,6.187500,230.721875,146.687500,3.596563,3.217250,17.674828,0.437500,0.406250,3.687500,2.8125
std,9.380832,6.026948,1.785922,123.938694,68.562868,0.534679,0.978457,1.780394,0.504016,0.498991,0.737804,1.6152
min,1.000000,10.400000,4.000000,71.100000,52.000000,2.760000,1.513000,14.500000,0.000000,0.000000,3.000000,1.0000
25%,8.750000,15.425000,4.000000,120.825000,96.500000,3.080000,2.581250,16.870000,0.000000,0.000000,3.000000,2.0000
50%,16.500000,19.200000,6.000000,196.300000,123.000000,3.695000,3.325000,17.420000,0.000000,0.000000,4.000000,2.0000
75%,24.250000,22.800000,8.000000,326.000000,180.000000,3.920000,3.610000,18.600000,1.000000,1.000000,4.000000,4.0000
max,32.000000,33.900000,8.000000,472.000000,335.000000,4.930000,5.424000,22.900000,1.000000,1.000000,5.000000,8.0000